---
kind: method
id: M:Autodesk.Revit.DB.MultiSegmentGrid.GetGridIds
source: html/203790e1-56b4-52d3-83f5-14ccd3409466.htm
---
# Autodesk.Revit.DB.MultiSegmentGrid.GetGridIds Method

Get the element ids of the Grids that make up this MultiSegmentGrid.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetGridIds()
```

## Returns
Element ids of Grids that make up this MultiSegmentGrid.